ubuntu/mint-practices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux mint 实践</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Linux mint 实践</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org92c836f">1. 查看版本</a></li>
<li><a href="#org8a47290">2. 查看对应的 ubuntu codename</a></li>
<li><a href="#org906f7c2">3. 更新软件</a></li>
<li><a href="#org17cf0db">4. 添加用户</a></li>
<li><a href="#orgd3b19b7">5. 添加用户到 sudo</a></li>
<li><a href="#orgd6174e1">6. 设置快捷键</a>
<ul>
<li><a href="#org99f1cba">6.1. 常规</a></li>
<li><a href="#orgc5807ee">6.2. 窗口</a>
<ul>
<li><a href="#orgc0d0c6e">6.2.1. 定位</a></li>
<li><a href="#orgab5a387">6.2.2. 大小</a></li>
<li><a href="#org1990f6f">6.2.3. 移动</a></li>
</ul>
</li>
<li><a href="#org06a625b">6.3. 工作区</a></li>
<li><a href="#orgdaec1e1">6.4. 抓屏</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org92c836f" class="outline-2">
<h2 id="org92c836f"><span class="section-number-2">1</span> 查看版本</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">lsb_release -a
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Distributor ID:</td>
<td class="org-left">LinuxMint</td>
</tr>

<tr>
<td class="org-left">Description:</td>
<td class="org-left">Linux Mint 19.1 Tessa</td>
</tr>

<tr>
<td class="org-left">Release:</td>
<td class="org-left">19.1</td>
</tr>

<tr>
<td class="org-left">Codename:</td>
<td class="org-left">tessa</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8a47290" class="outline-2">
<h2 id="org8a47290"><span class="section-number-2">2</span> 查看对应的 ubuntu codename</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">grep DISTRIB_CODENAME /etc/upstream-release/lsb-release | grep -o --colour=never <span style="color: #ff4ea3;">"[a-z-]*$"</span>
</pre>
</div>

<pre class="example">
bionic

</pre>
</div>
</div>

<div id="outline-container-org906f7c2" class="outline-2">
<h2 id="org906f7c2"><span class="section-number-2">3</span> 更新软件</h2>
<div class="outline-text-2" id="text-3">
<p>
安装一些必要开发软件：
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt install -y aptitude build-essential automake autoconf libtool cmake tmux im-config
sudo apt upgrade
</pre>
</div>
</div>
</div>
<div id="outline-container-org17cf0db" class="outline-2">
<h2 id="org17cf0db"><span class="section-number-2">4</span> 添加用户</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh">adduser &lt;username&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd3b19b7" class="outline-2">
<h2 id="orgd3b19b7"><span class="section-number-2">5</span> 添加用户到 sudo</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
usermod -aG sudo &lt;username&gt;
</pre>
</div>
</div>
<div id="outline-container-orgd6174e1" class="outline-2">
<h2 id="orgd6174e1"><span class="section-number-2">6</span> 设置快捷键</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org99f1cba" class="outline-3">
<h3 id="org99f1cba"><span class="section-number-3">6.1</span> 常规</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Super + D 显示桌面</li>
<li>Super + L 锁定屏幕</li>
<li>Super + E 进入主目录</li>

<li>Ctrl + Alt + T 打开终端</li>

<li>Ctrl + Alt + Del 注销</li>
<li>Ctrl + Alt + End 关机</li>
<li>Ctrl + Alt + Escape 重启</li>
</ul>
</div>
</div>

<div id="outline-container-orgc5807ee" class="outline-3">
<h3 id="orgc5807ee"><span class="section-number-3">6.2</span> 窗口</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-orgc0d0c6e" class="outline-4">
<h4 id="orgc0d0c6e"><span class="section-number-4">6.2.1</span> 定位</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li>将窗口移动到【左右上下】角</li>
</ul>
</div>
</div>

<div id="outline-container-orgab5a387" class="outline-4">
<h4 id="orgab5a387"><span class="section-number-4">6.2.2</span> 大小</h4>
<div class="outline-text-4" id="text-6-2-2">
<ul class="org-ul">
<li>Alt + F8 改变窗口大小</li>
<li>Alt + F9 最小化窗口</li>
<li>Alt + F10 最大化窗口</li>
<li>Super + [Left|Right|Up|Down] 将窗口向【左右上下】 平铺</li>
<li>Ctrl + Super + [Left|Right|Up|Down] 将窗口向【左右上下】 吸附（好像作用和上面的差不多）</li>
</ul>
</div>
</div>

<div id="outline-container-org1990f6f" class="outline-4">
<h4 id="org1990f6f"><span class="section-number-4">6.2.3</span> 移动</h4>
<div class="outline-text-4" id="text-6-2-3">
<ul class="org-ul">
<li>Alt + TAB 在打开的窗口间循环</li>
<li>Alt + F7 移动窗口</li>
<li>Shift + Super + [Left|right|Up|Down] 将窗口移动到【左|右|上|下】方的显示器</li>
<li>Shift + Ctrl + Alt + [Left|Right] 将窗口移动【左|右】侧工作区</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org06a625b" class="outline-3">
<h3 id="org06a625b"><span class="section-number-3">6.3</span> 工作区</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Alt + F2 类似 Windows 下的 Win + R 组合键</li>
<li>Ctrl + Alt + [Left|Right] 切换到【左|右】侧工作区</li>
</ul>
</div>
</div>

<div id="outline-container-orgdaec1e1" class="outline-3">
<h3 id="orgdaec1e1"><span class="section-number-3">6.4</span> 抓屏</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>Print 抓取屏幕截图</li>
<li>Shift + Print 选区截图（但是不知道为什么没有生效，使用 shutter -s 替换）</li>
<li>Ctrl + Shift + Print 复制选区截图到剪贴板（但是不知道为什么没有生效）</li>
<li>Alt + Print 对窗口截图（使用 shutter -a 替换）</li>
<li>Ctrl + Alt + Print 复制窗口截图到剪贴板</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:52</p>
<p class="validation"></p>
</div>
</body>
</html>
